package Practice.Lesson3;

/*
Площа прямокутників

Знайти площу яку займають N прямокутників на площині.
У всіх прямокутників одна зі сторін лежить на осі абсцис (X).
Дано три масива довжиною N.
В першому масиві Х координата нижньої-лівої вершини і-го прямокутника ,
висота в другому, ширина в третьому. Всі значення невід'ємні.
Приклад:
X - [0, 0]
H - [20, 10]
W - [10, 20]
Відповідь - 300.
Середня
Stack
 */

public class RectangleSquare {

    public int measure(int[] x, int[] h, int[] w) {

        return 0;
    }
}
